2022.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-08-15 Mon 19:52 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2022‽</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta property="og:title" content="2022‽">
<meta property="og:description" content="">
<meta property="description" content="">
<meta property="og:image" content="https://notes.neeasade.net/assets/img/backgrounds/warm.png">
<meta property="og:url" content="https://notes.neeasade.net/2022.html">
<meta name="twitter:card" content="summary">
<link rel='stylesheet' href='/assets/css/colors.css?sum=abd38449620b2223dffce2c948aae610'>
<link rel='stylesheet' href='./assets/css/colors.css?sum=abd38449620b2223dffce2c948aae610'>
<link rel='stylesheet' href='/assets/css/new.css?sum=4868ab8522b4e4059bfc5213fd799d61'>
<link rel='stylesheet' href='./assets/css/new.css?sum=4868ab8522b4e4059bfc5213fd799d61'>
<link rel='stylesheet' href='/assets/css/org.css?sum=19824060f71383b34e196f76ea8c38f1'>
<link rel='stylesheet' href='./assets/css/org.css?sum=19824060f71383b34e196f76ea8c38f1'>
<link rel='stylesheet' href='/assets/css/notes.css?sum=9044fadcb170cd5d407e2ad298337840'>
<link rel='stylesheet' href='./assets/css/notes.css?sum=9044fadcb170cd5d407e2ad298337840'>
</head>
<body>
<div id="content" class="content">
<div style="float: left">
    <a href='/index.html'>Up: neeanotes📜</a>
</div>

<div style="float: right">
    <a href="https://github.com/neeasade/neeasade.github.io/commits/source/posts/2022.org">Last edit: <2022-08-15></a>
</div>

<p>
<h1 class=title>2022‽</h1>
</p>


<hr>

<p>
hi!!!!! ✨✨✨✨✨
</p>

<p>
I am still very alive.
</p>

<p>
This site goes through more redesigns than writings sometimes, I swear.
</p>

<p>
I&rsquo;ve still been living my life and things, and just not been posting as much here as I have in my journal.
</p>

<p>
Really it&rsquo;s been about a year and 7 months since posting here, and that pretty much directly correlates with the length of my employment. My site generator was broken in it&rsquo;s own special way and I didn&rsquo;t feel like fixing it, let alone <span class="underline">writing</span> new stuff, but now I&rsquo;ve swung by to give it some tender love and care, even the ability to only partially generate the site, so we&rsquo;ll see. A constant goal is that there should be a very low bar to writing anything out and just seeing what sticks.
</p>

<p>
The start of 2022 saw me get really interested in meditation, through an app with a new age guru type. It&rsquo;s been a wonderful journey and has increasingly put me &ldquo;in my own body&rdquo; so to speak, instead of detached from it (wandering in the future or past). That might read pretty Woo if you&rsquo;ve never meditated, so I&rsquo;ll I think I&rsquo;ll dedicate a post to it another time.
</p>

<p>
Anyways one result of this mindfulness-focus has been an intense interest in yoga, which is also very good at getting you into the present moment. When you settle into a tough pose or enter a holding stance, your brain starts to pull away in much the same fashion a distracting thought or wrong impression. Seeing that wandering and coming back to the endless adjustments you can keep making with your breath is great practice for continuously matching your action to your intent.
</p>

<p>
Plus it feels pretty damn good
</p>

<p>
Other things:
</p>

<ul class="org-ul">
<li>Emacs still the best</li>
<li>I&rsquo;m around the KC area</li>
<li>Been reading a lot in the past few weeks, binging stuff on a kobo-reader with <a href="https://github.com/baskerville/plato">Plato</a>!
<ul class="org-ul">
<li>Currently: The Three Musketeers</li>
</ul></li>
<li>Games? Sometimes age of mythology</li>
<li>Had covid twice, it&rsquo;s ass</li>
<li>On twitter too much</li>
<li>ct.el got a shiny update</li>
<li>tarp is now myron-themes. be submitted to melpa soon??</li>
</ul>


<p>
<div class='flair'></div>
</p>

<div class='footer-left'>
    <a href='/index.html'>neeanotes📜</a>
</div>

<p>
<div class=footer-center>type: post</div>
</p>

<div class="footer-right">
    <a href="https://raw.githubusercontent.com/neeasade/neeasade.github.io/source/posts/2022.org">Page Markup</a>
</div>
</div>
</body>
</html>
